paypal-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/paypal/storeCreditCard.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.paypal.storecreditcard">
   <soapenv:Header/>
   <soapenv:Body>
   <urn:Paypal>
     <urn:paypalApiUrl>https://api.sandbox.paypal.com</urn:paypalApiUrl>   
   	<urn:cardno>4417119669820331</urn:cardno>
   	<urn:payerid>user12345</urn:payerid>
   	<urn:cardtype>visa</urn:cardtype>
   	<urn:expiremonth>5</urn:expiremonth>
   	<urn:expireyear>2018</urn:expireyear>
   	<urn:firstname>Joe</urn:firstname>
   	<urn:lastname>Shopper</urn:lastname>
   	<urn:cvv2>421</urn:cvv2>   	
   </urn:Paypal>
   </soapenv:Body>
</soapenv:Envelope>

